Tekla Open API Reference for Tekla Structures 2025
PourUnit.GetObjects Method
 Returns all objects related to pour unit, pour object not included.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetObjects()
Public Function GetObjects As ModelObjectEnumerator
Return Value
Type: ModelObjectEnumerator
A list of model object on success, otherwise null.
See Also
Reference
PourUnit Class
Tekla.Structures.Model Namespace